{
    "junior sharings": [
        {
            "name": "Cordelia Lee",
            "memory": "My favorite memory was on Valentines day. It was interesting to do VDOC at the nursing home for the first time. I also enjoyed the street tacos afterwards. I really loved the activities planned out for the sleepover afterwards as well. My memo post on the wall at the beginning of the winter quarter was fulfilled. :)",
            "sharings": {
                "bob": "Thank you for welcoming me to your home and helping us grow. ",
                "jocelyn": "Thank you for being such a great leader and always mentoring and taking care of us.",
                "blake": "",
                "abby": "",
                "cristian": "Thank you for preparing food and setting up things for us. ",
                "jo": "Thank you for mentoring and reaching out to me + keeping me updated and connected with A2F + taking me to places/home and making memories! I am extremely thankful for you!",
                "brianna": "Thank you for planning junior transfer events and having us over at your place. ",
                "andrew": ""
            }
        },
        {
            "name": "Jasmine Chen",
            "memory": "One of my favorite memories is when Jo sent me jasmine boba milk tea for my birthday in the beginning of May. I hadn't realized a few days before that she asked what my favorite boba was for this purpose, so I was quite surprised when she had texted me that she sent me Ding Tea boba through Postmates on my birthday (also I hadn't expected anything for my birthday). It arrived at my house about an hour after she texted me, and I was so very happy because I hadn't had any real, quality boba milk tea (or any boba milk tea for that matter) since the quarantine began. Plus it was just the right amount of sweet, so it really made my day.",
            "sharings": {
                "bob": "I find you really funny, so thank you for always brightening up the room with your cool and hilarious (though occasionally slightly/borderline questionable) vibes. You carry conversations well too - I enjoy the small talk every now and then. You guys have done so much for our class - thanks so much for carrying the whole responsibility of our class plus the transfers with Jocelyn in the beginning of this school year and beyond.",
                "jocelyn": "You've done so much for our class this year, I can't even begin to say how thankful I am for you. You've cooked for the whole lot of us, motivated us to exercise in lifegroup, paid for our meals and boba (still haven't gotten the chance to treat you yet T^T), went through C201 with me and Julia, and took the time to listen to our problems and worries. I don't think even the video we made for your birthday could illustrate our appreciation for you; I wished we could also cook for you this year and have spent more fun times doing life together. But suffice to say, I am so thankful for you and how you have served us with so much love - I aspire to be like you.",
                "blake": "",
                "abby": "",
                "cristian": "",
                "jo": "I'm so thankful for you, I really enjoy the times I get to talk to you and hang out with you. I'm so glad that we got closer this year, and thanks for always listening to me and giving me advice, doing DT with me (even though I overslept multiple times TAT), and grabbing meals with me. I really miss the times when we were still doing stuff together as sophomores and seniors, but constantly you've been like an older sister to me and I am so very thankful for you.",
                "brianna": "Even though we haven't spent a lot of time together, I am still very thankful for you in my life. I enjoyed the times we would talk during open home and during the car rides. You were very patient and insightful, and I am very glad to have gotten to know you better this year.",
                "andrew": ""
            }
        },
        {
            "name": "Jakin Wang",
            "memory": "My favorite memory was during the winter quarter when Blake and Abbey took us to the beach. We played beach volleyball the dark, which our team lost terribly. We singed some hymns while listening to the waves crashing on to the beach. During that time, I have some deep talks with JP about Christ and Faith. Afterwards, we went to a McDonalds where Nathan got a pony as a toy !!!!!!!!!!!!!!!!!",
            "sharings": {
                "bob": "Bob and Jocelyn, thank you for welcoming me to A2F and cooking good food for us.",
                "jocelyn": "Bob and Jocelyn, thank you for welcoming me to A2F and cooking good food for us.",
                "blake": "Blake and Abby, thank you for being my leader and teaching me a lot about the bible. From you, I have learned how to practice faith in life. Thanks for treating us like family and loving us transfers.",
                "abby": "Blake and Abby, thank you for being my leader and teaching me a lot about the bible. From you, I have learned how to practice faith in life. Thanks for treating us like family and loving us transfers. ",
                "cristian": "",
                "jo": "",
                "brianna": "Brianna, thank you for caring for us throughout the whole year. You have the nicest heart.",
                "andrew": ""
            }
        },
        {
            "name": "Byren Huang",
            "memory": "I really enjoyed playing Survivor on Zoom with Bob, Jocelyn, Cristian, Joe, and some of the juniors! It was really cool how we were able to have fun even without seeing each other in person. I am thankful that our combined efforts allowed us to realize that Survivor was more than just the game: we freed Bob!!! It was an incredible memorable experience. Thank you staff for organizing the event!",
            "sharings": {
                "bob": "Thank you Bob for helping me grow my faith and still keeping in touch with me through Zoom calls! ",
                "jocelyn": "Thank you Jocelyn for cooking delicious food for us this year, as well as the years before! I hope to steal your recipes to cook for my family one day!",
                "blake": "Thank you Blake for making a great impression before I first joined A2F, especially that time we played basketball together at Hitch!",
                "abby": "Thank you Abby for helping the juniors!",
                "cristian": "Thank you Cristian for spending time to organize events and games! I appreciate the time you dedicate to our group! And thanks for those Buffalo Wild Wings that one time at 714!",
                "jo": "Thank you Jo for helping the juniors!",
                "brianna": "Thank you Brianna for helping the juniors!",
                "andrew": "Thank you Andrew Park for helping the juniors!"
            }
        },
        {
            "name": "Sara ",
            "memory": "There are lots of epic memories, but I think the best were the ones were all the late night talks I had a lot with Jocelyn at her place (with Bob too sometimes) throughout Fall Quarter. Whenever something troublesome came up, Jocelyn would pick me up at night, grab yummy desserts or Taco Bell, then head back to her place where we'd feast and have meaningful talks that ended in her fortifying prayers. I also appreciate the practical or random facts Bob would spout, like how kimchi is the world's #1 superfood. The time we went to a gas station was also one of my most grateful memories because it was an incredibly distressing day and they truly gave me a glimpse of God's love and grace as well as solifying my belief that they are BOSS spiritual parents. ",
            "sharings": {
                "bob": "Thank you for being a mentor, role model, and spiritual leader! I deeply appreciate how you and Jocelyn took on our class and all of the practical and fun nuggets of wisdom! Thank you and Jocelyn for being sources of truth, reality-checks, and comfort during rough times. Thank you for being a spiritual father/uncle? figure and when you helped pass the time in the ER with fun/random things. I'm thankful for all of your advice and the questions you answered (even teaching me the #1 self defense move). You and Jocelyn are great leaders and it's been awesome being led by you two! GAMSAH-HAMNIDA! ",
                "jocelyn": "Hello Jocelyn. I love you Jocelyn. Words of affirmation is not up-there in terms of my love language, so please multiply what I say by 10 because I can't perfectly articulate how thankful I am for you. Right off the bat, you were deeply invested in our relationship and never held back in helping me, encouraging me, and strengthening me. I always looked forward to walking to your place and cooking with you, seeing you at C301 & home group, going on fun rides with you, etc. The walks we took around 550 or in your neighborhood were precious, as well as Sky High where I tried to impress you with a flip. I know it was dreadful but I'm SO GRATEFUL/STILL CAN'T BELIEVE that you chose to stay with me in the ER. Thank you for painfully pinching my leg to numb the shot pains:) Thank you for all of the feedback you'd give me and prioritizing my spiritual well-being no matter what. Thank you for leading me out of some dark places and always showing grace, patience, and love. Thank you for maturing me and teaching me how to accept truth in order to grow (I honestly think you've helped me become more logical than I was before haha). With you and your prayers it's been easier handling problems and going to God. You always redirected me to the Word. Thank you for the playlist you made. Thank you for leading our class and strengthening the sisters. Thank you for bringing fun wherever you are. It's never a dull moment with you. Thank you for helping my apartment reconcile during Winter Retreat in that tiny room in the most loving and wisest way ever. Thank you (x3000) for being my leader and for being my spiritual mother/aunt/older sister? figure! Thank you for setting an example as a strong role model, someone whose faith and emotional intelligence I hope to emulate one day:) Thank you for lifting me up when I didn't think it was possible to, and that just tells how incredibly loving and determined you are to serve. I can confidently say that I've experienced God's love and grace for me through you, Jocelyn. You truly are a light. I'm so blessed to have you in my life. Thank you for teaching me how to cook and buying cookies. Thank you for Postmating boba here. Thank you for everything, Jocelyn. I hope I can write you a song one day too or some cheesy poem cause I'm seriously all over the place right now cause I suck at this stuff...but I MISS YOU SO MUCH AND I CAN'T WAIT TO SEE YOU AGAIN AND CONTINUE BEING LED BY YOU. THANK YOU JOCELYN, I SARANG YOU:)",
                "blake": "",
                "abby": "Hi Abby!! I want to thank you, first off, for driving me to Joanne's wedding because I think that's when we had our first deep conversation and got to know each other. I remember you talking about forgiveness on the car ride back and that actually helped me out a lot:)  I'm so thankful for how you and Blake joined our class and led the transfers, and for being such a fun and kind leader. Thank you for all the love, compassion, patience, wisdom, and strength you've poured out onto me and the other students. I'm thankful to have you as a staff and as a spiritual aunt/older sister figure! I hope you we can see each other soon!!",
                "cristian": "",
                "jo": "HI JO:) It's so cool and crazy (in a good way!) that you're one of the junior class staff leaders. I remember meeting you and getting to know you when I was freshmen and you were a junior. Thank you for letting me basically live at your apartment. I'l never forget that one night where you and your peer sisters prayed for me and comforted me when I was going through something seriously difficult. I always look back on that as a reminder of how loving you and your class was, but I also remember how you made mochi too! Thank you for being patient and loving to me and to the other students and for being an older sister I can look up to. You've always been a role model of strength to me and I'm grateful for how you've shared about your past to encourage us and teach us. Thank you for serving the junior class and GPLA, Jo! I can't wait to see you soon:) ",
                "brianna": "Hi Briannaa!!!!!!! I remember the first time we really got to know each other was during the Georgia Mission Trip:) We were in the same car with Hannah and in that creepy house with the kid named Sawyer everywhere. You have always been an older sister to me, from the moment you put eyeliner on me during the trip (haha) till now as you have lovingly and diligently served our class. You're always joyful and wearing a smile that brightens the room. I'm grateful for how you've loved the sisters, and your capacity to love is so amazing! I'm so glad to have you as an older sister and role model and I'm looking forward to continue serving with you. I miss you and hope you're doing well:)",
                "andrew": ""
            }
        },
        {
            "name": "Howard",
            "memory": "The day we started the Caltech ministry. A couple of us went with Bob and Jocelyn to Caltech on a Saturday to scout the campus. It definitely never occurred to me that we could have a service at Caltech the next day. But it happened and it really showed me how much Bob and Jocelyn both care about the lives of these college students and the burden they have for them. But on the other hand, it shows how \"spontaneous\" and how well they respond to change, which are traits that I admire the most in them.",
            "sharings": {
                "bob": "Thanks for all the talks that we've had, whether it's about how much I value career or even about topics like my own values vs values of the church body. I remember the talk we had at that boba shop when I kinda just spilled whatever was on my mind - I was actually at a point where I was really unhappy about church life and church in general. But I'm glad we talked through my though process and you using biblical truths and wisdom to provide a lot of guidance for me and showed me that I make quick decisions based on my feelings rather than in truth. Also wanna thank you for holding all of us accountable - it made me really uncomfortable at first but I realized that it was actually such a blessing for someone to really genuinely care about my spiritual state (even more than I do/did). Love how you're so manly and have such high expectations for all of us when we would often rather settle for less. I owe a lot of my maturity to you and I'm glad that you've always been someone I can count on for advice or support.",
                "jocelyn": "I appreciate your heart for others. I'd say that me and Jocelyn are actually very similar - in terms of ambitions, competency, and how we relate to others. I really look up to how practical and competent Jocelyn is while at the same time being so loving and caring for all of us at the same time. I think back to the time when you were constantly getting sick - because you were working your job so hard while at the same time always trying to look out for us by providing meals. Really encourages me to want to share the same heart for others and live a life of sacrifice. ",
                "blake": "I really appreciate how much love you showed the transfers. I know that the transfer and non-transfer split was really hard on a lot of us but you handled the situation so well and made the transfers feel so loved. I think we have a lot of similar interests and ambitions so you're always someone I can go to for guidance with things like career, thinking bionically in areas like time and money.",
                "abby": "",
                "cristian": "We go way back to my freshman year and I want to thank you for constantly checking up on me then because I was shady and didn't like going to church. I guess now, I really enjoy the conversations we've had because you're so open and honest about the things that you've been through and sharing about your own experiences with your family, career, and faith.",
                "jo": "I've always been close with your peer bros and it was cool seeing how different you were from your bros. It's been really cool serving alongside you at Caltech and seeing how hard you try to serve others in whatever way you can - you don't pick and choose what you want to do, which showed me that I should respond to where I'm need with the same kind of heart. ",
                "brianna": "I remember my freshman summer when there was that week when we would constantly run into one another on the bus from Santa Monica back to Westwood after work. I never told you this but I would actually try and get off work at a time you usually got up b/c we had such good conversations. I really didn't even know you at the time but you were always so warm to me and willing to share parts of your testimony with me.",
                "andrew": "I know that we didn't get to spend a whole lot of time with you but I really appreciate how hard you worked for our class - whether it was treating us out to ice cream or even coming over to our apartment to hang out with us. I know that you're generally a super introverted person and seeing you put yourself out there for us was really encouraging to an introvert like me."
            }
        },
        {
            "name": "Jeffrey Ding",
            "memory": "At InterHigh, it was so funny when our team was in the elevator and Blake and one of the parents realized that they were from the same town in Northern China and they had like a \"bro, me too!\" moment. They even had a bro hand clasp moment and added each other on WeChat. It was just so funny that our all Chinese team ran into one of the few Chinese members of our Korean InterHigh church.",
            "sharings": {
                "bob": "Thank you Bob for leading our class and teaching our D Group. I was inspired by your willingness to deny yourself everyday to serve our Junior class and at Cal Tech. I hope to become a true nan ren of God in order to make you proud.",
                "jocelyn": "Thank you Jocelyn for leading alongside Bob and being patient with us. I'm extremely thankful for all the delicious meals you made for us and your passion for serving our class and ministry.",
                "blake": "Thank you Blake for leading the transfers and our InterHigh church. I greatly admire your attitude and enthusiasm in ministry, leading to some of the funniest moments I've ever experienced.",
                "abby": "Thank you Abby for leading alongside Blake. It was really great to serve with you in InterHigh. Thank you for being intentional with us despite moving to our church here in LA.",
                "cristian": "Thank you Cristian for being willing to answer the need for our junior class. Thank for coming over so often with good food and laughs for us to enjoy. ",
                "jo": "",
                "brianna": "",
                "andrew": "Thank you Andrew for taking on the responsibility of leading the junior bros. Thank you for faithfully serving us since our first year."
            }
        },
        {
            "name": "Winston Lau",
            "memory": "My favorite memory with Bob would have to be when serving together in Texas last summer. That was when I met gangster Bob for the first time. Overall, many things are worth remembering, from feeling self-conscious while doing dining hall outreach with Bob, to working on the NSWN skit together, to sharing BEEF RIBS, to playing basketball (even only with 3 fingers on my left hand for ... reasons ...). While there are many memories to choose from, my favorite is undoubtedly a memory of his smile at the New Student Welcome Night post event celebration. Everyone was excited and emotional because of NSWN, but Bob had the biggest smile I've ever seen on anyone, and I knew at that moment that all the hard work paid off. I knew at that moment that Bob was experiencing a joy that came from giving his all to the LORD that is incomparable to that of the world's lesser joys, and I remember feeling more joy from how joyful Bob was than from just my own joy. ",
            "sharings": {
                "bob": "Thank you for being such a faithful and patient and understanding and humble leader this last year. I know that it takes a lot to lead (which is exactly why I run away from it). It's hard enough as it is, and I definitely did not make it easy on you this year with all of my doubts,  questions, lostness, and resistance in general. Nonetheless, you were patient and faithful, never giving up on me, and constantly giving me space to process your lessons and come to my own conclusions. Even now, during quarantine, I appreciate you eagerness to desire to disciple us even amidst all the other obligations and responsibilities you have that are keeping you busy. You give everything your absolute all and push farther where most would be content to stop, finding creative ways to train us up rather than settling for the regular. Bob, thank you for your love, I hope to be a disciple and man who can live up to all that you've poured out and sacrificed for me.",
                "jocelyn": "Thank you for your care and diligence this year! I used to only know you for your cooking and competitiveness. However, getting to know you more, I have learned of many impressive traits, from organization and administrative skills to general competence and a fast-paced nature. You channel all of these skills into ministry, planning, and caring for the class. I feel like the many projects we are able to take part in is because of your efforts in organizing and keeping us together. Thank you for all of your love too, for caring so deeply about our souls, even taking the time to talk to me about my spiritual state and telling me words that I needed to hear. Thank you for being the first to say something when we accidentally segregate into groups by gender, thank you for cooking, for opening up your home so much, thank you for all of the hard work that you put in to us and your ministry. The junior class needs you Jocelyn!",
                "blake": "Thank you for all that you've done this year Blake! Serving alongside you and Abby in Interhigh has been such a great privilege. I love your enthusiasm and charismatic messages. You and Abby put a lot of thought into leading us and the kids. I thought the apologetics series for the kids was really perfect since many of them were struggling with the notion of God's existence. It was a creative way to respond to where they were at. In addition, I also really appreciated the focus time we had when we watched the youth pastor give tips on talking to the youth. For some reason, learning to improve my talking to youth skills never came to mind as a way to improve myself for God's kingdom, and it's in the little things like these that show just how much thought you both put in to trying to love us and the Interhigh kids, really thinking and responding to our needs. I also can't stress enough how grateful I am for your effort in helping me improve my message writing skills with your tips and thoughts. Thank you Blake!",
                "abby": "Thank you for your effort this year! Interhigh was a really fun and rewarding experience for me and my faith, and I am glad I got to serve alongside you and Blake. Thank you for leading by example as you stepped outside of your comfort zone to lead praise even though you were (self-proclaimed) \"not that good at guitar and singing\" (which I disagree with by the way). You and Blake put a lot of thought into leading us and the kids. The focus time where we watched the youth pastor give tips on dialoguing with the kids responded to our needs. The apologetics series responded to the kids' needs. Overall, I just saw how much thought you both put into the ministry and it was encouraging. Thank you for driving us all the time, for all the Starbucks you have bought us, and for your efforts practicing for praise! I know a lot of time went into those. Thanks Abby! ",
                "cristian": "Thank you Cristian for your joy and enthusiasm! Serving with you in Texas was so fun. I'm always encouraged when I see you using your skills to bless others. Even with things like dancing, I'm so happy that you are so willing to come up with awesome choreographies for weddings and other things! I know its been a couple years now, but post-grad life seems demanding, so thank you for continuing to learn on the fly and give this class your best efforts. Thank you for trusting me and for praying with me. Most of all, thank you for your constant smile. Your laugh is contagious and lifts me up anytime I hear it. I honestly don't know how you stay so cheerful all the time, but thank you for that! ",
                "jo": "Thanks Jo for your efforts this year and for all the guidance and patience with the USC Preview Service planning! It was my first time sort of leading, and video making, so I appreciate all the feedback. Now understanding the difficulty of video editing, I thank you all the more for all the time that you put in to those videos. Editing videos really does that ALOT of time, I still can't believe it takes so long. Thank you! ",
                "brianna": "",
                "andrew": "Thank you Andrew! Your sacrificial love does not go unnoticed, and I am grateful for all the times you put other people above yourself. You've been such a blessing to me, especially as I look at you, your introverted nature, and your comfort zone, and how you set these things aside to try to minister and love our class. I hope that one day I can also learn to be as sacrificial, putting my ministry above my own comfort zones. God Bless you Andrew. "
            }
        },
        {
            "name": "Kayla Nokelby",
            "memory": "One of my favorite memories with Brianna was the time when we went out for Pho one Saturday during Winter quarter. We didn’t do anything super fancy, we just caught up and talked, but it was one of those times that I will always remember because we had great conversation and a lot of laughs! Afterwards we went thrift shopping, and I ended up getting one of my favorite shirts that now always reminds me of that day~",
            "sharings": {
                "bob": "",
                "jocelyn": "Thank you for all the wisdom you've shared with me over this past year! I definitely use all the advice you've given me on a daily basis~",
                "blake": "",
                "abby": "Thank you for helping me through all of my struggles Winter quarter and for just always being there for me!",
                "cristian": "",
                "jo": "Thank you for always making me laugh and being such a bright (albeit with a lot of dry humor mixed in) presence in my life!",
                "brianna": "Thank you for being such an amazing friend and mentor, and always having my back, and always having the right words to say! ",
                "andrew": ""
            }
        },
        {
            "name": "Andrew Chau",
            "memory": "During winter retreat at Pali this year, I remember going on a hike with Bob, Winston, and a few others. We saw a few deer, listened to silence in the mountains, and found a gazebo. I remember laying out branches in the shape of an arrow for Farrah and Ashley to follow, but they didn't see it.",
            "sharings": {
                "bob": "Bob, thank you so much for your patience and wisdom throughout this past year. I know that I tend to be pretty reserved, and so I've always appreciated that the times we spend together are intentional and meaningful. In particular, there were a couple decisions this year I made about serving at my home church and work. I can be indecisive, and I remember wanting a simple yes or no from you, but instead you led me to think through those decisions myself so that I might grow and mature in those areas of my life. I can't thank you enough for the countless meals and late nights that you've spent for our class. It's given me a new perspective on what a life surrendered to God looks like, and it's a picture I will keep in my mind for the rest of my life. Thank you.",
                "jocelyn": "Jocelyn, thank you so much for your warmth and openness throughout this past year. There are so many ways that you've bent over backwards to serve me and my peers, between cooking our favorite foods, making us study during study sessions, and pushing us to strive for excellence in ministry. I'm really amazed by the amount of care and consideration you've shown towards us, in big and small ways alike, and it encourages me to be more conscious and thoughtful towards the people around me. ",
                "blake": "",
                "abby": "",
                "cristian": "Cristian, thank you so much for your willingness to serve and generosity throughout this past year! One small memory I have is when you, me, Eric, and Jeff went shopping for curry ingredients, and then arrived at Bob's place with steaks. I'm really cheap and it had been a long time since I had eaten something like that, but you didn't even hesitate when Eric suggested it. Another time you brought wings to our place, but most people were gone, so I became one of the primary benefactors of that gesture. I really appreciate the ways that you've served me and the other guys in big and small ways. ",
                "jo": "",
                "brianna": "",
                "andrew": ""
            }
        },
        {
            "name": "Skyla Nava",
            "memory": "One of my favorite memories with the junior staff was at the A2F Welcome Night at the start of junior year. Amidst the glowing twinkling lights and loud chatter, was a warm and joyous occasion as we all kicked off the year with an opportunity to re-connect after the long summer. I remember feeling a sense of excitement for the new year as I re-connected with Bob and Jocelyn, my peers, and soon to be junior staff. ",
            "sharings": {
                "bob": "Thank you Bob!! I am so grateful for your willingness to take on the junior class and teach us how to appreciate God's word. I have always been encouraged by your zeal for the gospel. I hope that one day, I too can become an impactful leader to the younger generation of believers. ",
                "jocelyn": "Jocelyn, I don't even know where to start because there have been too many moments that we have shared that I feel grateful for. I was nervous at first growing closer to a new leader last year, but you took on the challenge. You welcomed me with loving arms and urged me to grow in my love for God and others around me. I cannot express how grateful I am to have you as my leader. Thank you for your encouragement, love, and honesty. ",
                "blake": "",
                "abby": "Abby! I want to thank you for always being a source of encouragement for me. You are warm and kind, and I miss having you around! I remember that conversation we had at Winter Retreat, and you listened to my worries and concerns. As I look back on moments such as these, I am incredibly thankful have someone like you in my life. I hope that one day I can emulate the same kind of warmth and care to others as you have shown me. ",
                "cristian": "Thank you Cristian!!! I have always admired your dance moves, and sense of joy. I am thankful for all the times you led our junior class in games or events, and I hope we will continue to share these types of moments in the future. ",
                "jo": "Jo, I am so grateful that we had the chance this year to get to know one another better and serve alongside each other. It was not long ago that I was hanging out in your apartment at 550; a place where we shared many happy moments. Thank you for your support and your honesty. I have been encouraged many times in my walk with God through our conversations. I cannot wait to share many more joyous moments with you!",
                "brianna": "Brianna! I am extremely grateful for all the moments we have shared these past few years. I remember when we started getting to know one another during my sophomore year. I have always seen you as a kind and caring person, and I am thankful for all the love you have shown me. You were there through some difficult times in my life, so thank you for being such a wonderful sister in Christ. I hope and pray we will continue to grow in our love for God and each other as time goes by. Thank you for everything!  ",
                "andrew": ""
            }
        },
        {
            "name": "JP",
            "memory": "Blake - we went to get dim sum one time and talked about when we each first came to the U.S., turns out we were both the only Chinese at our schools, both had nickname \"Chino\" and played soccer with the Hispanic kids.\n\nBob - I was sick at some point and Bob drove to all the way to Holly to give me some cold medicine along with a jug of orange juice; I ended up drinking the OJ in one go and my stomach did not have a good time that night.\n\nCristian - we went sledding together at the winter retreat, Cristian took the steeper path and hurt his ankle. For the next hour or so I watched him telling everyone not to worry while clearly in pain.",
            "sharings": {
                "bob": " Thanks for grabbing ice cream waffles with me when everyone else was on diets :)",
                "jocelyn": "Thanks for always making delicious food and being enthusiastic about everything",
                "blake": "Thanks for introducing me to Incan gold; every time I see the words \"danger\" and \"treasure\" now my mind would read them in your voice",
                "abby": "Thanks for the delicious salmon Zongzi and other food",
                "cristian": "",
                "jo": "",
                "brianna": "",
                "andrew": "Thanks for teaching me course 101, I had a fun time and learned a lot from you. Also thanks for always showing up on time and waiting while we manage to be late almost every time :)"
            }
        },
        {
            "name": "Julia Zueck",
            "memory": "I remember at winter retreat this year there were two lawn chairs set up looking off over the mountain with such a beautiful view. Jo and I spontaneously sat in those chairs and had such a deep yet comfortable conversation about Christian living and why she chose to be college ministry staff. I appreciate how Jo is so relatable and understanding. I felt closer to her( and not just because we sat squished in the back of the car on the ride up together), inspired, and at peace. I wonder if she did too?",
            "sharings": {
                "bob": "Thank you for letting us visit your home and for leading fun jam sessions with your guitar!",
                "jocelyn": "Thank you so much for leading me faithfully in my spiritual journey from the beginning and still presently :). ",
                "blake": "",
                "abby": "",
                "cristian": "Thank you for all your fun ideas and creative dances!",
                "jo": "",
                "brianna": "Thank you for caring for me and just being there to chat and sharing your experiences/advice. It has always helped me :)",
                "andrew": ""
            }
        },
        {
            "name": "Hannah Robison",
            "memory": "Celebrating Valentine’s Day by going to a convalescent home with my home group was one of my favorite experiences of the year. I really saw God’s love working through my peers and through Abby, Blake, and Brianna. And playing board games afterwards at an ice cream shop was a blast too!",
            "sharings": {
                "bob": "Even though I came later in the year as a student, you really showed God’s love to me from dropping me off at the dorms after a Friday night service to welcoming me to Home Group! Thank you for leading the juniors this year!",
                "jocelyn": "Jocelyn, you were one of the first people I interacted with at A2F. Even though I was scared to come to service because of my shyness, you were so welcoming and immediately introduced me to other people who I now call my friends. I will forever be grateful to you for helping me find a Christian fellowship at school! I still remember you taking me out for boba and how much it touched me that you were willing to answer my questions about God. From the bottom of my heart, thank you!",
                "blake": "Blake, you have been such an awesome leader! From the first minute I stepped into your apartment, you were not only welcoming to me but also to the friends I had brought, which truly meant the world to me. I remember bringing my friend Jackson, who’s not a Christian but really enjoyed his time at your place and even continued to talk about how nice you were once we returned to the dorms. You are kind and hilarious and I have loved playing board games with you this year. Thank you for leading the transfer juniors this year; we really appreciate it!",
                "abby": "Abby, you have such a sweet and gentle heart and I know I can talk to you about anything! Thank you for being such a great leader for the junior transfers in both our life and home groups. I loved how you really fostered a community where we could be honest with each other about our walks with God. One of my favorite memories was when you brought us a watercolor activity and we painted Bible verses while sharing thoughts, revelations, emotions, and the like. I had to leave early that night, but I really didn’t want to! I appreciate your texts too, to make sure I’m doing well. Thank you so much for welcoming us into your home and always making our community feel like a family.",
                "cristian": "",
                "jo": "Jo, thank you so much for being an amazing staff member! Your welcoming and enthusiastic energy has been such a comfort to me this year. I’m naturally really shy, but you immediately made me feel welcome and like I fit right into A2F. I really appreciate your spontaneous care packages,  you hosting dinner at your place, and your warm hellos every time I see you. (And of course, I love discussing Meyers Briggs personality tests with you too!) Thank you again for being such a fantastic part of my time at UCLA.",
                "brianna": "Brianna, you have been such a constant source of love and joy throughout this year. From the first time I was at A2F, I was amazed at everyone’s servant heart and the way you readily offered a ride to people to go to Culver City for a night hike; at the time, I didn’t know school clubs could be that welcoming! Since then, you’ve never failed to show compassion and service in everything you do, from the spontaneous care packages, to you buying me ice cream on Valentine’s Day, to you running our Life Group and checking in on us. You have been a great role model for every student this year and I strive to be as generous and loving as you one day. Thank you so much for being an amazing staff member and friend!",
                "andrew": ""
            }
        },
        {
            "name": "Juyi",
            "memory": "I had the pleasure to cook for all the juniors in Bob and Jocelyn's house. I cooked shrimp fettuccine. The pasta got burned but it turned out to be alright in the end! I hope everyone liked it!",
            "sharings": {
                "bob": "Thank you Bob for initiatively taking me into your place and I remember listening to your tips on finding jobs. You also helped me with revising my resume! Also, the hiking was cool haha, even though my skin on my neck is coming off lol.",
                "jocelyn": "Thank you Jocelyn for being so nice and welcoming!! You have been so nice and a big sister to me since day 1! I also appreciate when we speak Chinese to each other haha, it's cute! Thank you fo an amazing year! looking for more to come!",
                "blake": "What's up my Chinese brother!! Yo man, it's been a great pleasure meeting you this year. I appreciate you for always being there as a big brother and remember we shared a lot while waiting for the zip-line? Man, the view on it was also sick!! Next year is going to be even better, you know why? Because we not only gonna have more fun, but also DANGER!! ",
                "abby": "Haha! Abby! I was really impressed by your cooking skills! Especially those dessert!! I remembered we had awesome conversation in the car, I am the best shot-guner haha!! Looking forward to more amazing memories this upcoming year!",
                "cristian": "Hope you are doing well my friend! I appreciate you for always being helpful and carrying! I still remember the gift that you hand me the snack during spring quarter finals week! That's so nice of you! Looking forward to more fun time together!",
                "jo": "Hi Jo!! Thank you for being so helpful! I remember you as a big sister who always have positive vibes! We also always meet each other before I enter the Northwest Auditorium! Looking forward to more memories this upcoming year!",
                "brianna": "Hello Brianna! It's been a great pleasure getting to know you this year and I find you have a great personality! Just like me ahahhah! Thank you for always being so helpful and caring! I look forward to more fun time next year! (Don't forget to treat my peer from Cañada nicely haha!)",
                "andrew": "Hey Andrew! It's been a long time since we last time see each other! Miss you big brother! Hope you are doing well! We had a great time studying Course 101 together, even though I was always late haha! Hope to see you soon! Miss you!"
            }
        },
        {
            "name": "Hannah Robison",
            "memory": "Celebrating Valentine’s Day by going to a convalescent home with my home group was one of my favorite experiences of the year. I really saw God’s love working through my peers and through Abby, Blake, and Brianna. And playing board games afterwards at an ice cream shop was a blast too!",
            "sharings": {
                "bob": "Even though I came later in the year as a student, you really showed God’s love to me from dropping me off at the dorms after a Friday night service to welcoming me to Home Group! Thank you for leading the juniors this year!",
                "jocelyn": "Jocelyn, you were one of the first people I interacted with at A2F. Even though I was scared to come to service because of my shyness, you were so welcoming and immediately introduced me to other people who I now call my friends. I will forever be grateful to you for helping me find a Christian fellowship at school! I still remember you taking me out for boba and how much it touched me that you were willing to answer my questions about God. From the bottom of my heart, thank you!",
                "blake": "Blake, you have been such an awesome leader! From the first minute I stepped into your apartment, you were not only welcoming to me but also to the friends I had brought, which truly meant the world to me. I remember bringing my friend Jackson, who’s not a Christian but really enjoyed his time at your place and even continued to talk about how nice you were once we returned to the dorms. You are kind and hilarious and I have loved playing board games with you this year. Thank you for leading the transfer juniors this year; we really appreciate it!",
                "abby": "Abby, you have such a sweet and gentle heart and I know I can talk to you about anything! Thank you for being such a great leader for the junior transfers in both our life and home groups. I loved how you really fostered a community where we could be honest with each other about our walks with God. One of my favorite memories was when you brought us a watercolor activity and we painted Bible verses while sharing thoughts, revelations, emotions, and the like. I had to leave early that night, but I really didn’t want to! I appreciate your texts too, to make sure I’m doing well. Thank you so much for welcoming us into your home and always making our community feel like a family.",
                "cristian": "",
                "jo": "Jo, thank you so much for being an amazing staff member! Your welcoming and enthusiastic energy has been such a comfort to me this year. I’m naturally really shy, but you immediately made me feel welcome and like I fit right into A2F. I really appreciate your spontaneous care packages,  you hosting dinner at your place, and your warm hellos every time I see you. (And of course, I love discussing Meyers Briggs personality tests with you too!) Thank you again for being such a fantastic part of my time at UCLA.",
                "brianna": "Brianna, you have been such a constant source of love and joy throughout this year. From the first time I was at A2F, I was amazed at everyone’s servant heart and the way you readily offered a ride to people to go to Culver City for a night hike; at the time, I didn’t know school clubs could be that welcoming! Since then, you’ve never failed to show compassion and service in everything you do, from the spontaneous care packages, to you buying me ice cream on Valentine’s Day, to you running our Life Group and checking in on us. You have been a great role model for every student this year and I strive to be as generous and loving as you one day. Thank you so much for being an amazing staff member and friend!",
                "andrew": ""
            }
        },
        {
            "name": "Karis",
            "memory": "My favorite memory is when we played Glow in the dark volleyball as a homegroup at the beach. Particularly when Brianna prayed for me, in a genuine way that made me feel so loved and cared for.  It was such a fun night playing together, this is the night when I really felt like I had a community in A2F with the transfers. Although I just started coming out to A2F in January, Blake, Abby, and Brianna created such a familial vibe and I really felt like we were able to bond over fun activities they came up with and DELICIOUS FOOD- shoutout Abby's curry. ",
            "sharings": {
                "bob": "",
                "jocelyn": "",
                "blake": "Thank you Blake for always being the life of the party and introducing us to fun games, I always tell my family how fun homegroup is and about all these new games I have been introduced to (mostly about \"DANGAAA\" and \"black purl\" / \"white purl\") . Thank you for always taking care of us, from giving us New Years envelopes to picking us up in the van every week and opening your home to us. I am so blessed to have met you this year! Germaine and I literally call you and Abby \"mom and dad\" behind your backs. ",
                "abby": "Abby! Thank you for being such a positive role model in my spiritual walk and being so welcoming to me into your home. I always tell my mom about how good you are at cooking and just how generous you are with your time! And how you're the same age as my sister but are so mature in your faith and just so kind. You are such a calm and insightful spirit that really brings me peace in the midst of my anxiety, thank you for helping me deepen my faith and checking in on us. You have been so welcoming and loving to me from the beginning and I know I have not been a part of A2F for a long time, but you welcomed me like an old friend and always loved on me. I appreciate everything you have done for me and the transfers. Germaine and I literally call you and Blake \"mom and dad\" behind your backs. Thank you for coming in to my life, can't wait to have homegroup in person again!",
                "cristian": "",
                "jo": "Jo! You are the staff member who always made me realize how relational this group is. Thank you for sending me snacks during finals, sending me boba, checking in on me at home, and just always being so warm to me. Your testimony is something that really made an impression on me and I admire your faithfulness and spiritual journey. Thank you for inviting me and Hannah to your home and cooking us udon (that was so good). I was looking forward to this quarter to get to know you better! Thank you for introducing me to A2F and just being so kind to me. ",
                "brianna": "Brianna, thank you so much for EVERYTHING! You have been so kind and generous to me. I really appreciate how you have put so much effort to reach out even during shelter in place. Thank you for always being considerate of me and just all the girls in life group. You have really shown me kindness and just been a great mentor and influence to help me be more generous to others. I really admire your ability to just invite people in and draw people closer to Christ. You have a real way of making people feel important and loved and Christ really shines through you. I can't wait to deepen our relationship in the years to come!",
                "andrew": ""
            }
        },
        {
            "name": "Sean Chen",
            "memory": "My favorite memory with Bob was when we went to IKEA with some of the bros over last summer. At first I was really just there to help out and wasn't planning on purchasing anything, until I saw this really cheap loft bed called SVARTA. Anyway, I ended up buying it, but it didn't fit in the car! We all tried really hard to figure out a way to make it work; but alas, I had to return it. Regardless, it was a really fun experience with everyone that I won't forget. Seeing how much time and effort Bob put into figuring out how to make it work, in addition to driving us there and buying me dinner really touched me.\n\nThe included picture is the four of them attempting to pose.",
            "sharings": {
                "bob": "Thanks for discipline me and leading me this past year. I'm grateful for all those talks and meals, and the time you've spend with me. You've taught me so much, and I've been able to apply it to my teachings to others as well. For that, I'm so grateful. ",
                "jocelyn": "Thanks for all the food! I appreciate all the work you've done in prepping it and delivering it to us. It has come in clutch many times! Thanks for the care packages and for looking out for us during stressful times.",
                "blake": "",
                "abby": "",
                "cristian": "Thanks for all the mentorship these past couple years. It's been a blessing having you as my C101 leader in freshman year, to having you as my staff this past year. Your enthusiasm always helps to make my stressful days better, and talking with you is always something I enjoy.",
                "jo": "",
                "brianna": "",
                "andrew": "I'll always be grateful for all the times that you reached out to talk to me back in freshman year when I was alone in the crowd. I won't forget that! It was fun trying to convince you to play league again XD. Thanks for doing me the favor of not agreeing, otherwise I might still be addicted haha..."
            }
        },
        {
            "name": "Jennifer Alex",
            "memory": "One of my favorite memories I have with Abby and Brianna is every life group that we have had together in person and through Zoom. The time spent together always uplifts my spirits, and reminds me that I always have people who I can rely on if I ever need anything. I also loved the home group times and dinners we had at Blake and Abby's place. It was always refreshing to take a break from school, and enjoy and evening fellowshipping with everyone. ",
            "sharings": {
                "bob": "",
                "jocelyn": "",
                "blake": "Blake! Thanks for all you do for us, and for always having us over at your place. Thank you for all that you have taught us during our home group time, and for all the activities and fun you come up with. Although I have only known you for a couple of months, you have always made me feel welcomed, so thank you!",
                "abby": "Thank you Abby for all that you have done for me the past two quarters. Thank you for all the life group times and homegroup times that we have had, and all the events that you planned. Thanks for taking the time to prepare food and everything else when we come over.  I've really enjoyed the time we've had during life group, learning, reflecting, and having fun. Thanks for always checking up on me and being there for me!",
                "cristian": "",
                "jo": "",
                "brianna": "Thank you Brianna for all that you have done for me this whole first year. You have always been there for me if I ever needed anything. Thanks for keeping me updated with all the events, and for all the rides you have given me. Thanks for cooking me dinner and hanging out with me!! Thanks for always checking up on me. You really made my transition to UCLA a lot easier, and I am so thankful that God put you in my life! ",
                "andrew": ""
            }
        },
        {
            "name": "Eric Wang",
            "memory": "One of my favorite memories from this past year was when Jeff, Andrew, and I joined Cristian and Bob in making curry and eating rare steaks. This was last quarter and we found the steaks on sale, and I really enjoyed spending the time cooking together and eating good food.",
            "sharings": {
                "bob": "Thank you for being such a great leader. I can't imagine how much work you've poured into not only our class, but in mentoring the junior transfers during fall quarter, as well as starting the CalTech ministry, even when it was at the expense of your own health. I'm glad that I've been able to serve alongside you at CalTech, and I'm also thankful for the mentorship you've provided me - whether it's through Course 301, or looking over my Course 101 notes during Fall quarter. I'm also grateful for the career and life advice you've blessed me with during the car-rides to CalTech. Even recently, with our life-group sessions over Zoom on Fridays, I find your summaries of DT to be really helpful since they give me insights that I never would have thought of. There's so much more that I'm thankful for, and I hope that with this next year, your mentoring will help me grow into a stronger Christian. ",
                "jocelyn": "Thank you for leading the junior class! As with Bob, I'm really thankful for just how much love you've poured into ministry and mentoring the junior class the past year. For example, I'm grateful how frequently you opened your home this past year for study sessions before finals week, as well as teaching course 301. Recently, I'm thankful for how you helped galvanize the junior class with the USC preview service, as well as now advising us with NSWN planning. I hope that with this final year, that I can continue to grow under both yours and Bob's mentorship! ",
                "blake": "",
                "abby": "",
                "cristian": "Thank you Cristian for helping lead the junior class. While it might seem small, I really appreciate how you go out of your way to ask us how we're doing. For example, you frequently ask how my brother is doing, and I'm thankful for that. I'm also really thankful for how open you are when talking about your own family and your experience in sharing the Gospel with them. ",
                "jo": "",
                "brianna": "",
                "andrew": ""
            }
        },
        {
            "name": "Julian van Riet",
            "memory": "One of my favorite memories with the staff from the school year was during Winter Retreat with Bob. Some of us guys went on a short nature hike with Bob around the area and ended up seeing some deer. The woods covered in snow was really scenic and I think it was a chill time to just enjoy nature and be able to soak up some wisdom from our leader. ",
            "sharings": {
                "bob": "I'm really thankful to you for pushing me and encouraging me. I think I'm often really stubborn or resistant when it comes to doing what's best for my spiritual health and growth, but you always keep me on the right path. I really appreciate that you have this vision for my life than often seems bigger than my own and that really motivates me. Even though you often have a lot on your plate, you're still able to make time to check up on me or listen when I need to talk to you about something. I'm super thankful that God has blessed me with a leader like you.",
                "jocelyn": "Thank you Jocelyn for everything you do for our class. Your energy and your enthusiasm are always encouraging when we're working hard to plan for events or do stuff together as a class. Also thank you for always cooking for us and feeding our class; it shows the love and care that you put into us.",
                "blake": "I'm thankful to Blake for being a staff that I'm able to have good conversation with. I really appreciate the times I've been able to talk to him and share my testimony and future plans with him, especially times like when we drove up to Winter Retreat together. ",
                "abby": "",
                "cristian": "Thankful to have you as a staff for our class this year. You add an energy that's really uplifting. I love being able to talk to you about stuff, whether it's about Christian life (see what I did there) or just how we've been. Also thanks for always being at the back of the room helping us with the choreography for dances, it really comes in clutch sometimes.",
                "jo": "Very thankful that you've joined our class and that between junior class events and CalTech we've been able to serve God together. ",
                "brianna": "",
                "andrew": ""
            }
        },
        {
            "name": "Farrah",
            "memory": "Austin Mission Trip - it was so nice to be back in my home state and to be at a college that I have so many attachments to, co-laboring with brothers and sister in Christ to share the gospel. The experience meant a lot to me and I learned so much about myself, about ministry, and from the Austin church. 50% of the team is now with/in the junior class so that's really neat!",
            "sharings": {
                "bob": "Hi Bob, thank you so much for all the effort and heart you (& boss) have put into the junior ministry. From going to Austin, doing transfer outreach, Caltech, and USC, I'm grateful for the opportunity to have served in so many places with you guys and to learn from you guys this year. I know how much our bros look up to you and I think it speaks a lot to the relationship you have with them! Thank you for being our spiritual parents and for always opening up your homes and lives to us!",
                "jocelyn": "Hi boss, I call you boss because you're one of the most independent, determined, and fierce people I have ever known, and that determination is something that you carry into your ministry with our class and others. Thanks for not being tired of us and always exhorting us through all our highs & lows. You are a source of truth, encouragement and spiritual advice in my life. I'm so grateful to have the opportunity to be ministered to by you and to do ministry with you in the past year. Not going to share too personally here but just wanted to let you know that the relationship we have is one of the best things that has ever happened to me. You're the best! :)",
                "blake": "Ba-la-kay! Those few months of doing InterHigh with you & Abby & the rest of the summer team are some of the best memories I have of serving, and they serve as a consistent reminder to me of why I am so passionate about youth ministry. The kids at Somang opened up a lot after you and Abby started leading youth group, and I think that really speaks to the kindness and warmth that you radiate to the people around you. I have never seen the youth so excited and nervous until we were practicing the special performance for your wedding; it really shows how much of an impact you guys have had on them. Thank you for putting in so much effort into ministering to them and also to our peers, they are truly lucky to have you as a role model & leader to look up to! Looking forward to another dim sum reunion and our eventual visit to James' dad's 羊肉串 store!",
                "abby": "Grandma Abs! Let's just say I am honored to have been your first visitor at the hospital canteen :) You are genuinely one of the gentlest and kindest people I know, and I have been so blessed through our many conversations over the summer as we traveled to and from InterHigh together. Thank you for opening up about parts of your testimony to me - I am still surprised sometimes of how similar our personalities and interests are. I am thankful that you were willing to share your time with me and that I had to opportunity to learn from your experiences and advice. My peers are lucky to have you as their home group leader! I am sad we don't get to serve at InterHigh together but I'm looking forward to the day we get to finally visit your apartment + do ministry together again!",
                "cristian": "Hi Cristian! I didn't really get to know you until we went on the Austin mission trip together last summer, but I'm thankful we had the opportunity to co-labor for the gospel. Your impact on GPLA is quite profound, especially in the five (?) weddings we had last year within the church! Not sure what any of us would do without our professional choreographer haha. Thanks for sharing your talents with the church community and also for faithfully ministering to our class this year!",
                "jo": "Auntie JoJo! It didn't seem that long ago when we would make weekly ventures to 304 and sleepover on your carpet haha... I guess we're all in different stages now with us being upperclassmen and you being staff. I would've never thought that we'd get to interact this much and that you would end up being our staff / come to Caltech together. Thanks for all the Trader Joe snack deliveries, Sawtelle meals, and boba trips together, and for just being so open about your experiences in ministry. I appreciate what you've done for our class and for your constant efforts in reaching out to me! Your class has provided a great example for us to emulate as we become seniors and do more outreach next year!",
                "brianna": "Brianna! I'm grateful that I got to know you better this year through serving in Austin and doing transfer outreach together. I remember the conversations we had then and also when we shared our testimonies during the fall quarter KBBQ last fall. I appreciate how much you've done for our class and your willingness to share about your experiences with me!",
                "andrew": ""
            }
        }
    ]
}